//  136 of 503 - Проверка частей часа через if-else в JavaScript
// Решите аналогичную задачу, только определите в какую
// треть часа попадает указанное количество минут.
// Решение:
// let min = сюда надо написать текущее время;
//
// if (min >= 0 && min <= 20) {
//     console.log('1 треть');
// }
//
// if (min >= 21 && min <= 40) {
//     console.log('2 терть');
// }
//
// if (min >= 41 && min <= 60) {
//     console.log('3 треть');
// }
//



// 137 of 503
//  Проверка длины строк и массивов в JavaScript

// let arr = [1, 2, 3];
//
// if (arr.length <= 3) {
//     console.log("Праильна!",arr[0] + arr[1] + arr[2]);
// } else {
//     console.log("Хуиня иди переделывай! тупой нефар")
// }
//
//
//
//

// 138 of 503
// let str = 'альпилемилиголд';
// Проверка символов строки в JavaScript
//  1)Дана переменная, содержащая некоторую строку. Проверьте, что эта строка начинается на символ 'a'.
// if (str[0] == 'a'){
//     console.log("Превая буква а");
// } else {
//     console.log("Первая бука не а")
// }

// 2)Дана переменная, содержащая некоторую строку. Проверьте, что эта строка заканчивается на символ 'x'.
//
// let str = 'Слово с окончанием x';
//
// if (str[str.length - 1] == 'x') {
//     console.log("Строка заканчивается на символ 'x'.");
// } else {
//     console.log("Говно переделывай!");
// }
//

// 3) Дана переменная, содержащая некоторую строку. Проверьте, что эта строка начинается на символ 'a' или символ 'b'.
// let str = 'a или b в начало ставим и проверяем!';
//
// if (str[0] == 'a' || str[0] == 'b') {
//     console.log('праильнга');
// } else {
//     console.log("Не начинается и не заканчивается")
// }
//













