//  136 of 503 - Проверка частей часа через if-else в JavaScript
// Решите аналогичную задачу, только определите в какую
// треть часа попадает указанное количество минут.
// Решение:
// let min = сюда надо написать текущее время;
//
// if (min >= 0 && min <= 20) {
//     console.log('1 треть');
// }
//
// if (min >= 21 && min <= 40) {
//     console.log('2 терть');
// }
//
// if (min >= 41 && min <= 60) {
//     console.log('3 треть');
// }
//



// 137 of 503
//  Проверка длины строк и массивов в JavaScript

// let arr = [1, 2, 3];
//
// if (arr.length <= 3) {
//     console.log("Праильна!",arr[0] + arr[1] + arr[2]);
// } else {
//     console.log("Хуиня иди переделывай! тупой нефар")
// }
//
//
//
//












